---
type: RuledFace
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# RuledFace

`Autodesk.Revit.DB.RuledFace` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Intersect | — | `` |
| Method | IsInside | — | `` |
| Method | Triangulate | — | `` |
| Property | Curve | — | `public Curve this [ int index ] { get ; }` |
| Property | IsExtruded | 2017 | `public bool IsExtruded { get ; }` |
| Property | Point | — | `public XYZ this [ int index ] { get ; }` |
| Property | RulingsAreParallel | 2014 | `public bool RulingsAreParallel { get ; }` |